# DWFXExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFXExportOptions Constructor
DWFXExportOptions Class See Also
---
Default constructor. Sets all options to their default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWFXExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DWFXExportOptions()
```

# See Also
DWFXExportOptions Class
Autodesk.Revit.DB Namespace